research/index.org
#+TITLE: 研究関連
#+DATE: 2017-10-30 13:39:50
#+LANGUAGE: ja
#+REF: research
#+LAYOUT: default
#+SETUPFILE: ../_setup.org
#+PERMALINK: /research/index.html
* 論文
** 査読有
   - _Sasaki, Y._, Takehiro, S.-I., Ishiwatari, M., Yamada, M., 2017:
     Effects of radial distribution of entropy diffusivity on critical modes of anelastic thermal convection in rotating spherical shells,
     hysics of the Earth and Planetary Interiors, =doi:10.1016/j.pepi.2017.09.003=
   - Takehiro, S-I., _Sasaki, Y._, 2017:
     Penetration of steady fluid motions into an outer stable layer excited by MHD thermal convection in rotating spherical shells,
     Physics of the Earth and Planetary Interiors,
     =doi: 10.1016/j.pepi.2017.03.001=
   - Matsui, H., Heien, E., Aubert, J., Aurnou, J.M., Avery, M., Brown, B., Buffett, B.A., Busse, F.H., Christensen, U.R., Davies, C.J., Featherstone, N., Gastine, T., Glatzmaier, G.A., Gubbins, D., Guermond, J.-L.,Hayashi, Y.-Y., Hollerbach, R., Hwang, R.J., Jackson, A., Jones, C.A., Jiang, W., Kellogg, L.H., Kuang, W., Landeau, M., Marti, P.H., Olson, P., Ribeiro, A., _Sasaki, Y._, Schaeffer, N., Simitev, R.D., Sheyko, A., Silva, L., Stanley, S., Takahashi, F., Takehiro, S.-I., Wicht, J., Willis, A.P., 2016:
     Performance benchmarks for a next generation numerical dynamo model,
     Geochemistry, Geophysics, Geosystem, =doi: 10.1002/2015GC006159=
   - Marti, P., Schaeffer, N., Hollerbach, R., Cebron, D., Nore, C., Luddens, F.,Guermond, J.-L., Aubert, J., Takehiro, S., _Sasaki, Y._, Hayashi, Y.-Y., Simitev, R., Busse, F., Vantieghem, S., Jackson, A., 2014:
     Full sphere hydrodynamic and dynamo benchmarks,
     Geophysical Journal International, 197, 119-134, =doi: 10.1093/gji/ggt518=
   - Takehiro, S., _Sasaki, Y._, Hayashi, Y.-Y., Yamada, M., 2013:
     Differential Rotation and Angular Momentum Transport Caused by Thermal Convection in a Rotating Spherical Shell,
     Progress in Physics of the Sun and Stars, 479, 285-294
   - Jackson, A. Sheyko, A., Marti, P., Tilgner, A., Cebron, D., Vantieghem, S., Simitev, R., Busse, F., Zhan, X., Schubert, G., Takehiro, S., Sasaki, Y., Hayashi, Y.-Y., Ribeiro, A., Nore, C., Guermondw, J.-L., 2013:
     A spherical shell numerical dynamo benchmark with pseudo-vacuum magnetic boundary conditions,
     Geophysical Journal International, 196, 712--723, =doi: 10.1093/gji/ggt425=
   - _Sasaki, Y._, Takehiro, S., Nishizawa, S., Hayashi, Y-Y., 2013:
     Effects of latitudinally heterogeneous buoyancy flux conditions at the inner core boundary of an MHD dynamo in a rotating spherical shell,
     Phys. Earth Planet. Inter., 223, 55-61, =doi:10.1016/j.pepi.2013.07.003=
   - Takehiro, S., Takahashi, Y.O., Sugiyama, K., Odaka, M., Ishiwatari, M., _Sasaki, Y._, Ishioka, K., Nishizawa, S., Nakajima, K., Hayashi, Y.-Y., 2012:
     Construction of Hierarchical Models for the Fluid Dynamics in Earth and Planetary Sciences : DCMODEL project.,
     In Proc. Inernational Conference on Simulation and Technology (JSST 2012), 301, Kobe, Japan, Sep. 27-28
   - _Sasaki, Y._, Takehiro, S., Nakajima, K., Hayashi, Y.-Y., 2012:
     Surface zonal flows induced by thermal convection in a rapidly rotating thin spherical shell,
     In Porc. Inernational Conference on Simulation and Technology (JSST 2012), 307, Kobe, Japan, Sep. 27-28
   - Ishiwatari, M., Toyoda, E., Morikawa, Y., Takehiro, S., _Sasaki, Y._, Nishizawa, S., Odaka, M., Otobe, N., Takahashi, Y. O., Nakajima, K., Horinouchi, T., Shiotani, M., Hayashi, Y.-Y., Gtool development group, 2012:
     gtool5 - development of Fortran90 library for self-descriptive multi-dimensional data input/output interfaces,
     Geosci. Model Dev., 5, 449-455., 2012, =doi:10.5194/gmd-5-449-2012=
   - _Sasaki, Y._, Takehiro, S., Hayashi, Y-Y., Kuramoto, K., 2011:
     Weak-field dynamo emerging in a rotating spherical shell with stress-free top and no-slip bottom boundaries.,
     Phys. Earth Planet. Inter., 188, 203--213., =doi:10.1016/j.pepi.2011.06.019=
** 査読無し
   - 竹広真一, 佐々木洋平, 石岡圭一, 2016:
     木星型惑星大気の縞状構造の成因の研究.
     平成 27 (2015) 年度地球シミュレータ利用報告書, pp.125--129.
   - 竹広真一, 佐々木洋平, 石岡圭一, 2014:
     木星型惑星大気の縞状構造の成因の研究.
     平成 26 (2014) 年度地球シミュレータ利用報告書
   - 佐々木 洋平, 竹広 真一, 中島健介, 林祥介, 2013:
     回転球殻内の非弾性流体熱対流の線形安定性,
     ながれ(日本流体力学会学会誌), 32, 469-472
   - 佐々木 洋平, 竹広 真一, 2011:
     熱フラックス固定境界条件下での回転球殻熱対流の線形安定性,
     ながれ 30 別冊, P. 57.
   - 竹広 真一, 佐々木 洋平, 西澤 誠也, 中島 健介, 林 祥介, 2011:
     回転球殻ダイナモに対する緯度方向不均一な内側浮力フラックス境界条件の影響,
     ながれ 30 別冊, P. 57.
   - 佐々木洋平, 竹広真一, 林祥介, 倉本圭, 2010:
     上端応力無し, 下端滑り無し条件を課した回転球殻中に出現する弱磁場ダイナモ,
     ながれ 29 別冊, 211
   - 佐々木洋平, 竹広真一, 林祥介, 倉本圭, 2009:
     回転球殻 MHD ダイナモ解に対する上部力学的境界条件の影響,
     ながれ 28 別冊, 106
   - 佐々木洋平, 竹広真一, 林祥介, 倉本 圭, 2008:
     回転球殻 MHD ダイナモにおける力学的境界条件の影響,
     ながれ, 27 別冊, 376.
   - 佐々木洋平, 竹広真一, 倉本圭, 林祥介, 2007:
     球殻の厚さを変えた回転球殻熱対流, ながれ, 26 別冊, 248.
   - 佐々木洋平, 小高正嗣, 竹広真一, 林祥介, 2004:
     ダイナモベンチマークにおける磁場生成維持機構の解析,
     ながれ, 23 別冊, 608-609
   - 佐々木洋平, 竹広真一, 林祥介, 2004:
     SPMODEL群の一環としての回転球殻MHD ダイナモの数値モデルの構築,
     ながれ, 22 別冊, 124-125
* 学会/研究集会発表
