research/index.html
---
title: 研究関連
date: 2017-03-30 17:09:52
layout: default
lang: ja
ref: research
permalink: /research/index.html
---
<div id="outline-container-org22d41c8" class="outline-2">
<h2 id="org22d41c8">論文</h2>
<div class="outline-text-2" id="text-org22d41c8">
</div><div id="outline-container-org87e6ea0" class="outline-3">
<h3 id="org87e6ea0">査読有</h3>
<div class="outline-text-3" id="text-org87e6ea0">
<ul class="org-ul">
<li>Takehiro, S-I., Sasaki, Y., 2017:
Penetration of steady fluid motions into an outer stable layer excited by MHD thermal convection in rotating spherical shells,
Physics of the Earth and Planetary Interiors,
<code>doi: 10.1016/j.pepi.2017.03.001</code></li>
<li>Matsui, H., Heien, E., Aubert, J., Aurnou, J.M., Avery, M., Brown, B., Buffett, B.A., Busse, F.H., Christensen, U.R., Davies, C.J., Featherstone, N., Gastine, T., Glatzmaier, G.A., Gubbins, D., Guermond, J.-L.,Hayashi, Y.-Y., Hollerbach, R., Hwang, R.J., Jackson, A., Jones, C.A., Jiang, W., Kellogg, L.H., Kuang, W., Landeau, M., Marti, P.H., Olson, P., Ribeiro, A., <span class="underline">Sasaki, Y.</span>, Schaeffer, N., Simitev, R.D., Sheyko, A., Silva, L., Stanley, S., Takahashi, F., Takehiro, S.-I., Wicht, J., Willis, A.P., 2016:
Performance benchmarks for a next generation numerical dynamo model,
Geochemistry, Geophysics, Geosystem, <code>doi: 10.1002/2015GC006159</code></li>
<li>Marti, P., Schaeffer, N., Hollerbach, R., Cebron, D., Nore, C., Luddens, F.,Guermond, J.-L., Aubert, J., Takehiro, S., <span class="underline">Sasaki, Y.</span>, Hayashi, Y.-Y., Simitev, R., Busse, F., Vantieghem, S., Jackson, A., 2014:
Full sphere hydrodynamic and dynamo benchmarks,
Geophysical Journal International, 197, 119-134, <code>doi: 10.1093/gji/ggt518</code></li>
<li>Takehiro, S., <span class="underline">Sasaki, Y.</span>, Hayashi, Y.-Y., Yamada, M., 2013:
Differential Rotation and Angular Momentum Transport Caused by Thermal Convection in a Rotating Spherical Shell,
Progress in Physics of the Sun and Stars, 479, 285-294</li>
<li>Jackson, A. Sheyko, A., Marti, P., Tilgner, A., Cebron, D., Vantieghem, S., Simitev, R., Busse, F., Zhan, X., Schubert, G., Takehiro, S., Sasaki, Y., Hayashi, Y.-Y., Ribeiro, A., Nore, C., Guermondw, J.-L., 2013:
A spherical shell numerical dynamo benchmark with pseudo-vacuum magnetic boundary conditions,
Geophysical Journal International, 196, 712&#x2013;723, <code>doi: 10.1093/gji/ggt425</code></li>
<li><span class="underline">Sasaki, Y.</span>, Takehiro, S., Nishizawa, S., Hayashi, Y-Y., 2013:
Effects of latitudinally heterogeneous buoyancy flux conditions at the inner core boundary of an MHD dynamo in a rotating spherical shell,
Phys. Earth Planet. Inter., 223, 55-61, <code>doi:10.1016/j.pepi.2013.07.003</code></li>
<li>Takehiro, S., Takahashi, Y.O., Sugiyama, K., Odaka, M., Ishiwatari, M., <span class="underline">Sasaki, Y.</span>, Ishioka, K., Nishizawa, S., Nakajima, K., Hayashi, Y.-Y., 2012:
Construction of Hierarchical Models for the Fluid Dynamics in Earth and Planetary Sciences : DCMODEL project.,
In Proc. Inernational Conference on Simulation and Technology (JSST 2012), 301, Kobe, Japan, Sep. 27-28</li>
<li><span class="underline">Sasaki, Y.</span>, Takehiro, S., Nakajima, K., Hayashi, Y.-Y., 2012:
Surface zonal flows induced by thermal convection in a rapidly rotating thin spherical shell,
In Porc. Inernational Conference on Simulation and Technology (JSST 2012), 307, Kobe, Japan, Sep. 27-28</li>
<li>Ishiwatari, M., Toyoda, E., Morikawa, Y., Takehiro, S., <span class="underline">Sasaki, Y.</span>, Nishizawa, S., Odaka, M., Otobe, N., Takahashi, Y. O., Nakajima, K., Horinouchi, T., Shiotani, M., Hayashi, Y.-Y., Gtool development group, 2012:
gtool5 - development of Fortran90 library for self-descriptive multi-dimensional data input/output interfaces,
Geosci. Model Dev., 5, 449-455., 2012, <code>doi:10.5194/gmd-5-449-2012</code></li>
<li><span class="underline">Sasaki, Y.</span>, Takehiro, S., Hayashi, Y-Y., Kuramoto, K., 2011:
Weak-field dynamo emerging in a rotating spherical shell with stress-free top and no-slip bottom boundaries.,
Phys. Earth Planet. Inter., 188, 203&#x2013;213., <code>doi:10.1016/j.pepi.2011.06.019</code></li>
</ul>
</div>
</div>
<div id="outline-container-orge861397" class="outline-3">
<h3 id="orge861397">査読無し</h3>
<div class="outline-text-3" id="text-orge861397">
<ul class="org-ul">
<li>竹広真一, 佐々木洋平, 石岡圭一, 2016:
木星型惑星大気の縞状構造の成因の研究.
平成 27 (2015) 年度地球シミュレータ利用報告書, pp.125&#x2013;129.</li>
<li>竹広真一, 佐々木洋平, 石岡圭一, 2014:
木星型惑星大気の縞状構造の成因の研究.
平成 26 (2014) 年度地球シミュレータ利用報告書</li>
<li>佐々木 洋平, 竹広 真一, 中島健介, 林祥介, 2013:
回転球殻内の非弾性流体熱対流の線形安定性,
ながれ(日本流体力学会学会誌), 32, 469-472</li>
<li>佐々木 洋平, 竹広 真一, 2011:
熱フラックス固定境界条件下での回転球殻熱対流の線形安定性,
ながれ 30 別冊, P. 57.</li>
<li>竹広 真一, 佐々木 洋平, 西澤 誠也, 中島 健介, 林 祥介, 2011:
回転球殻ダイナモに対する緯度方向不均一な内側浮力フラックス境界条件の影響,
ながれ 30 別冊, P. 57.</li>
<li>佐々木洋平, 竹広真一, 林祥介, 倉本圭, 2010:
上端応力無し, 下端滑り無し条件を課した回転球殻中に出現する弱磁場ダイナモ,
ながれ 29 別冊, 211</li>
<li>佐々木洋平, 竹広真一, 林祥介, 倉本圭, 2009:
回転球殻 MHD ダイナモ解に対する上部力学的境界条件の影響,
ながれ 28 別冊, 106</li>
<li>佐々木洋平, 竹広真一, 林祥介, 倉本 圭, 2008:
回転球殻 MHD ダイナモにおける力学的境界条件の影響,
ながれ, 27 別冊, 376.</li>
<li>佐々木洋平, 竹広真一, 倉本圭, 林祥介, 2007:
球殻の厚さを変えた回転球殻熱対流, ながれ, 26 別冊, 248.</li>
<li>佐々木洋平, 小高正嗣, 竹広真一, 林祥介, 2004:
ダイナモベンチマークにおける磁場生成維持機構の解析,
ながれ, 23 別冊, 608-609</li>
<li>佐々木洋平, 竹広真一, 林祥介, 2004:
SPMODEL群の一環としての回転球殻MHD ダイナモの数値モデルの構築,
ながれ, 22 別冊, 124-125</li>
</ul>
</div>
</div>
</div>
