research/index.org
** 海外
   - _Sasaki, Y._, Takehiro, S.-I., Ishiwatari, M., Yamada, M., 2017:
     Effects of radial distribution of entropy diffusivity on critical modes of anelastic thermal convection in rotating spherical shells (numerical analysis)
     Compressible Convection Conference
   - _Sasaki, Y._, Takehiro, S.-I., Ishiwatari, M., Yamada, M., 2017:
     Rapidly rotating two-dimensional annulus model for anelastic critical thermal convection with tilting boundaries and radially varying entropy diffusivity
     Compressible Convection Conference
   - Takehiro, S., _Sasaki, Y._, 2017:
     Erosion of a thermally induced stably stratified layer by compositional convection in the Earth's outer core.
     AOGS 2017
   - Takehiro, S., _Sasaki, Y._, 2017:
     Erosion of a thermally induced stably stratified layer by compositional convection in the Earth's outer core,
     IAG-IASPEI 2017
   - Takehiro, S., _Sasaki, Y._, Ishioka, K., Nakajima, K., Hayashi, Y.-Y., 2017:
     Mean zonal flows induced by Boussinesq thermal convection in rotating spherical shells as an application to the gas giant planets.
     WTK Aquaplanet Workshop, 21st January 2017, National Astronomical Observatory of Japan.
   - Takehiro S., Takahashi, Y. O., Sugiyama, K., Odaka, M., Ishiwatari, M., Horinouchi, T., _Sasaki, Y._, Ishioka, K., Nakajima, K., Hayashi, Y.-Y., 2017:
     GFD-Dennou Club DCMODEL project.
     WTK Aquaplanet Workshop, 24th January 2017, CPS, Kobe University.
   - _Sasaki, Y._, Takehiro, S., Ishiwatari, M., Yamada, M., 2016:
     Critical mode of anelastic thermal convection in a rotating spherical shell depends on radial distribution of thermal diffusivity,
     SEDI The 15th Symposium, Nantes, France.
   - Takehiro, S., _Sasaki, Y._, 2016:
     Penetration of mean zonal flows into an outer stable layer excited by MHD thermal convection in rotating spherical shells,
     SEDI The 15th Symposium, Nantes, France.
   - Sasaki and Takehiro, S.-I. 2015:
     Penetration of magneto-hydrodynamic disturbances into a strongly stable outer layer caused by MHD dynamo in a rotating spherical shell,
     Japan SEDI symposium 2015.
   - Sasaki,Y., Takehiro, S. 2014,
     Penetration of magneto-hydrodynamic disturbances into an outer strongly stable layer caused by MHD dynamo in a rotating spherical shell,
     The 14th symposium of SEDI, Study of the Earth's Deep Interior, at the Shonan Village Center, Kanagawa, Japan, from August 3 to 8
   - Takehiro, S., Sasaki, Y., Takahashi, Y. O., Nakajima, K., Hayashi, Y.-Y., Kuramoto, K., 2013,
     Diversity of atmospheric circulations of sycronized rotating Jovian type planets.
     5th Subaru International Conference: Exoplanets and Disks:Their Formation and Diversity II,
     Dec. 8 to 12 2013, Sheraton Kona Resort & Spa Keauhou Bay, The Big island of Hawaii.
   - Sasaki, Y., Takehiro, S., Kuramoto, K., Hayashi, Y.-Y. 2013:
     Weak-field dynamo emerging in a rotating spherical shell with stress-free top and no-slip bottom boundaries,
     Mathematical analysis of magneto-hydrodynamical processes in stars, Sep. 26, 2013, Kansai Seminar House, Sakyo-ku, Kyoto, Japan.
   - Yoshiyuki O. Takahashi, Kouichirou Sugiyama, Masatsugu Odaka, Masaki Ishiwatari, _Youhei Sasaki_, Seiya Nishizawa, Kensuke Nakajima, Shin-ichi Takehiro, Yoshi-Yuki Hayashi, 2012
     Construction of Hierarchical Models for the Fluid Dynamics in Earth and Planetary Sciences : DCMODEL project,
     AGU Fall Meeting 2012, Dec 5th, 2012, San Francisco, California, USA.
   - _Sasaki, Y._, Takehiro, S., Nishizawa, S., Nakajima, K., Hayashi Y.-Y., 2012 :
     Effects of latitudinally heterogeneous buoyancy flux conditions at the inner boundary on MHD dynamos in a rotating spherical shell.
     The 13th Symposium of SEDI, Study of the Earth's Deep Interior, at the University of Leeds, UK, in Parkinson Court, from July 1 to 6
   - _Sasaki, Y._, Takehiro, S., Nakajima, K., Hayashi, Y.-Y., 2012:
     Development of an anelastic convection model in rotating spherical  shells for stars, gas and icy giant planets,
     The 13th Symposium of SEDI, Study of the Earth's Deep Interior, at the University of Leeds, UK, in Parkinson Court, from July 1 to 6
   - _Sasaki, Y._, Takehiro, S., Nishizawa, S., Nakajima, K., Hayashi, Y.-Y., 2012:
     Effects of latitudinally heterogeneous buoyancy flux conditions at the inner boundary on MHD dynamos in a rotating spherical shell,
     CPS 9th International School of Planetary Sciences.
   - _Sasaki, Y._, Takehiro, S., Nakajima, K., Kuramoto, K., Hayashi, Y.-Y., 2012:
     Development of an anelastic convection model in rotating spherical  shells for stars, gas and icy giant planets,
     CPS 9th International School of Planetary Sciences.
   - Ishiwatari1, M., K. Ishioka, S.-I. Takehiro, Y.-Y. Hayashi, S. Nishizawa, Y. O. Takahashi, M. Odaka, _Y. Sasaki_, K.-I. Sugiyama, T. Yamashita, Y. Morikawa, K. Nakajima, and GFD Dennou Club, 2010:
     DCMODEL: Hierarchical models for geophysical fluid dynamics and planetary atmospheres.
     CPS 6th International School of Planetary Sciences, P-18, 4-9 January, 2010, Kobe, Japan
   - _Sasaki, Y._, Takehiro, S., Kuramoto, K., Hayashi, Y.-Y., 2011:
     Weak-field dynamo emerging in a rotating spherical shell with stress-free top and no-slip bottom boundaries,
     AGU Fall Meeting 2011, Dec. 5th, 2011, San Francisco, California, USA.
   - _Sasaki, Y._, Takehiro, S., Hayashi, Y-Y., Kuramoto, K., 2011:
     Weak-field dynamo emerging in a rotating spherical shell with stress-free top and no-slip bottom boundaries,
     CPS 7th International School of Planetary Sciences, at Seapal Suma, Kobe, Japan, from January 10 to 15, 2011.
   - _Sasaki, Y._, Takehiro, S., Hayashi, Y-Y., Kuramoto, K., 2010:
     Weak-field dynamo emerging in a rotating spherical shell with stress-free top and no-slip bottom boundaries,
     The 12th Symposium of SEDI, Study of the Earth's Deep Interior, at the University of California at Santa Barbara, California, USA, in the Corwin Pavilion, from July 18 to 23, 2010
