research/index.org
** 国内
   - _佐々木 洋平_,  石岡 圭一, 竹広 真一, 中島 健介, 石渡 正樹, 林 祥介, 2017:
     高速回転する薄い球殻内の熱対流により生成される表層縞帯状構造の消滅
     気象学会 2017年秋季大会
   - _佐々木 洋平_,  石岡 圭一, 竹広 真一, 中島 健介, 石渡 正樹, 林 祥介, 2017:
     高速回転する薄い球殻内の熱対流により生成される表層縞帯状構造の消滅
     第142回 地球電磁気･地球惑星圏学会, 総会・講演会(2017年 秋学会)
   - _佐々木 洋平_,  石岡 圭一, 竹広 真一, 中島 健介, 石渡 正樹, 林 祥介, 2017:
     高速回転する薄い球殻内の熱対流により生成される表層縞帯状構造の消滅
     日本惑星科学会、2017年周秋季講演会
   - 竹広真一, 佐々木洋平, 2017:
     回転球殻ダイナモにより引き起こされる磁気流体擾乱の強い安定成層への貫入,
     2017 年日本流体力学会年会
   - 竹広真一, _佐々木洋平_, 2017:
     地球外核の上部安定成層に対する組成対流の貫入,
     日本地球惑星科学連合 2017 年大会
   - _佐々木洋平_, 竹広真一，石渡正樹，山田道夫, 2017:
     回転球殻内の非弾性熱対流の臨界モードに対する熱拡散係数の動径分布の影響,
     日本地球惑星科学連合 2017 年大会
   - 竹広真一, 佐々木洋平, 2017:
     地球外核の上部安定成層に対する組成対流の貫入,
     新学術領域「核ーマントルの相互作用と共進化」成果報告会
   - 佐々木洋平, 竹広真一, 石渡正樹, 山田道夫 2016:
     回転球殻内の非弾性熱対流の臨界モードに対する熱拡散係数の動径分布の影響,
     2016年日本流体力学会年会
   - 竹広真一, 佐々木洋平 2016:
     回転球殻中の磁気対流により引き起こされる平均帯状流の外側安定成層への貫入.
     2016 年日本流体力学会年会
   - 竹広真一, 佐々木洋平, 2016:
     回転球殻中の磁気対流により引き起こされる平均帯状流の外側安定成層への貫入.
     日本地球惑星科学連合 2016 年大会, 2016 年 5 月 23 日,
     幕張メッセ国際会議場 講演セッション (講演番号: MIS10-P05)
   - 佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2016:
     高速回転する薄い球殻内の熱対流により生成される表層縞状構造への力学的境界条件の影響.
     日本地球惑星科学連合 2016 年大会
   - 佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2016:
     高速回転する薄い球殻内の熱対流により引き起こされる表層縞状構造の消滅,
     2016 年日本天文学会春季大会, 2016 年 3 月 15日, 首都大学東京 (講演番号 Z322b)
   - 佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2016:
     高速回転する薄い球殻内の熱対流により生成される表層縞状構造への力学的境界条件の影響.
     惑星大気研究会「水惑星」 2016 年 3 月 10 日, 神戸大学惑星科学研究センター
   - 竹広真一, 佐々木洋平, 石岡圭一, 2016:
     高速回転する薄い球殻内の熱対流により引き起こされる表層縞状構造への力学的境界条件の影響,
     平成 27 年度地球シミュレータ利用報告会, 2016 年 3 月 11 日 (金), コクヨホール
   - 佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2016:
     高速回転する薄い球殻内の熱対流により生成される表層縞状構造への力学的境界条件の影響.
     2016 年春季気象学会
   - 佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2015:
     高速回転する薄い球殻内の熱対流により引き起こされる表層縞状構造の消滅.
     2015 年日本流体力学会年会, 東工大大岡山キャンパス
   - 佐々木洋平, 竹広真一, 2015:
     回転球殻ダイナモにより引き起こされる磁気流体擾乱の強い安定成層への貫入.
     日本地球惑星科学連合 2015 年大会.
   - 佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2015:
     高速に回転する薄い球殻内の熱対流により引き起こされる表層縞状構造の消滅.
     日本地球惑星科学連合 2015 年大会.
   - 佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2015:
     高速に回転する薄い球殻内の熱対流により引き起こされる表層縞状構造の消滅.
     2015 年 日本気象学会春季大会
   - 佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2014:
     高速回転する薄い球殻中の対流により引き起こされる表層の帯状流,
     日本気象学会 2014 年度秋季大会, 福岡国際会議場
   - 佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2014:
     高速回転する薄い球殻内の熱対流により引き起こされる表層の帯状流,
     2014 年日本流体力学会年会, 2014 年 9 月 15 日, 東北大学川内北キャンパス
   - 佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2014:
     高速に回転する薄い球殻内の熱対流により引き起こされる表層の帯状流,
     日本地球惑星科学連合 2014 年大会, 2014年5月1日(木), 講演番号 PCG38-01
   - 竹広真一, 佐々木洋平, 林祥介, 山田道夫, 2013:
     回転球殻内の熱対流による角運動量輸送と太陽差分回転について,
     2013 年日本流体力学会年会 2013 年 9 月 13 日 東京農工大学
   - 佐々木洋平, 竹広真一, 中島 健介, 林祥介, 2013:
     回転球殻内の非弾性流体熱対流の線型安定性,
     2013 年日本流体力学会年会 2013 年 9 月 13 日, 東京農工大学
   - 佐々木 洋平, 竹広 真一, 中島 健介, 林 祥介, 2013:
     恒星・ガス惑星・氷惑星内部を念頭においた非弾性球殻対流モデル,
     日本地球惑星科学連合 2013 年大会 2013 年 5 月 20 日: 幕張メッセ国際会議場.
   - 竹広真一, 佐々木洋平, 林祥介, 山田道夫 2013:
     回転球殻内の熱対流によって引き起こされる差分回転と角運動量輸送.
     2013 年日本天文学会春季大会, 2013 年 3 月 22 日, 埼玉大学.
   - 佐々木洋平, 竹広真一, 2013:
     ガス惑星を念頭に置いた回転球殻対流,
     系外惑星大気ワークショップ 2013 年 3 月 4 - 5 日, 東京大学
   - Shin-ichi Takehiro, Yoshiyuki O. Takahashi, Ko-ichiro Sugiyama, Masatsugu Odaka, Masaki Ishiwatari, Youhei Sasaki, Seiya Nishizawa, Keiichi Ishioka, Kensuke Nakajima, Yoshi-Yuki Hayashi, 2013:
     Construction of Hierarchical Models for Fluid Dynamics in Earth and Planetary Sciences : DCMODEL project,
     惑星大気小研究会, 2013 年 2 月 5 日, 惑星科学研究センター
   - _佐々木洋平_, 竹広真一, 中島健介, 林祥介, 2012:
     薄い回転球殻対流により引き起こされる表層の帯状流,
     日本惑星科学会 2012年度秋季講演会,
     2012年 10 月 25 日, 神戸大学統合研究拠点
   - _佐々木 洋平_, 竹広 真一, 西澤 誠也, 林 祥介, 2012:
     階層的地球流体スペクトルモデル集 SPMODEL を用いた 惑星磁場ダイナモ計算
     第132回 SGEPSS総会および講演会,
     2012 年 10 月 23 日 (火), 札幌コンベンションセンター
   - _佐々木 洋平_, 竹広 真一, 中島 健介, 林 祥介, 2012:
     薄い回転球殻対流により引き起こされる表層の帯状流,
     日本気象学会 2012 年度秋季大会,
     2012 年 10 月 3 日, 北海道大学学術交流会館(講演番号 C168)
   - 竹広 真一, _佐々木 洋平_, 中島 健介, 林 祥介, 2012 :
     熱フラックス固定条件下での高速回転する円筒内の熱対流の線形安定性に対するエクマン摩擦の影響,
     日本流体力学会年会2012, 2012 年 9 月 17 日, 高知大学朝倉キャンパス
   - _佐々木 洋平_, 竹広 真一, 中島 健介, 林 祥介, 2012 :
     薄い回転球殻対流により引き起こされる表層の帯状流,
     日本流体力学会年会2012, 2012 年 9 月 16 日, 高知大学朝倉キャンパス
   - _佐々木 洋平_, 竹広 真一, 中島 健介, 林 祥介, 2012:
     恒星・ガス惑星の深部大気対流モデルの構築,
     日本地球惑星科学連合 2012 年大会, 講演番号JP-PS21
   - _佐々木 洋平_, 竹広 真一, 西澤 誠也, 中島 健介, 林 祥介, 2012:
     回転球殻ダイナモに対する緯度方向不均一な内側浮力フラックス境界条件の影響.
     日本地球惑星科学連合 2012 年大会., 講演番号JS-EM21
   - 高橋 芳幸, 杉山 耕一朗, 小高 正嗣, 石渡 正樹, _佐々木 洋平_, 西澤誠也, 中島 健介 竹広 真一, 林 祥介, 2011:
     共通のプログラムスタイルを持つ大気大循環モデルと雲解像モデルの開発,
     日本惑星科学会 2011 年秋季講演会, 2011 年 11 月 25 日, 相模女子大学翠葉会館 (講演番号 S32-06).
   - 高橋 芳幸, 杉山耕一朗, 小高 正嗣, 石渡 正樹, _佐々木 洋平_, 西澤 誠也, 中島 健介, 竹広 真一, 林 祥介, 2011:
     惑星大気計算のための大循環モデルならびに雲解像モデルの構築,
     日本気象学会 2011 年度秋季大会, 2011 年 11 月 16 日, 名古屋大学東山キャンパス (講演番号 D111).
   - 竹広 真一, _佐々木 洋平_, 西澤 誠也, 中島 健介, 林 祥介, 2011 :
     回転球殻ダイナモに対する緯度方向不均一な内側浮力フラックス境界条件の影響,
     日本流体力学会年会 2011, 2011 年 9 月 7 日, 首都大学東京南大沢キャンパス.
   - _佐々木 洋平_, 竹広 真一, 倉本 圭, 林 祥介, 2011:
     回転球殻MHDダイナモの初期磁場依存性,
     日本地球惑星科学連合 2011 年大会, 2011 年 5 月 26 日, 幕張メッセ国際会議場 (講演番号 S-EM36).
   - _佐々木 洋平_, 竹広 真一, 2011:
     熱フラックス固定境界条件下での回転球殻熱対流の線形安定性解析,
     日本地球惑星科学連合 2011 年大会, 2011 年 5 月 22 日, 幕張メッセ国際会議場 (講演番号 MIS021-P02)
   - _佐々木 洋平_, 竹広 真一, 林 祥介, 2010:
     回転球殻 MHDダイナモにおける上部力学的境界条件の影響,
     国立天文台 CfCAユーザーズミーティング, 2010 年 1 月 12 ～ 13 日, 国立天文台三鷹キャンパス.
   - _佐々木 洋平_, 竹広 真一, 林 祥介, 2008:
     回転球殻 MHD ダイナモにおける力学的境界条件の影響
     国立天文台 CfCA ユーザーズミーティング, 2008 年 12 月 17日, 国立天文台三鷹キャンパス.
   - _佐々木 洋平_, 竹広 真一, 林 祥介, 倉本 圭, 2008:
     下端に粘着条件・上端に応力無し条件を課した回転球殻 MHD ダイナモ計算,
     日本地球惑星科学連合 2008 年大会, 2008 年 5 月 28 日, 幕張メッセ国際会議場, 講演番号: E111-011
   - _佐々木 洋平_, 小高 正嗣, 林 祥介, 竹広 真一, 2004:
     ダイナモベンチマーク・ケース1 における磁場生成維持機構の解析,
     地球惑星科学関連学会 2004年合同大会, 2004 年 5 月 12 日, 幕張メッセ国際会議場, 講演番号: E012-004
   - _佐々木 洋平_, 竹広真一, 林祥介, 2002:
     回転球殻 MHD ダイナモの数値モデルの構築,
     理論天文学懇談会, 2002 年 12 月 24日(火) - 26 日(木), 国立天文台三鷹キャンパス
* 教育
  - 2017:
    - 京都大学 情報基礎[理学部](後期開講) 担当(分担)
    - 摂南大学 微積分 II[理工学部](前期開講) 担当
    - 摂南大学 微積分 I[理工学部](後期開講) 担当
  - 2016:
    - 京都大学 情報基礎[理学部](後期開講) 担当(分担)
    - 摂南大学 数学基礎I, II[経営学部](通年) 担当
    - 摂南大学 微積分 II[理工学部](前期開講) 担当
  - 2015:
    - 京都大学 情報基礎[理学部](後期開講) 担当(分担)
    - 摂南大学 数学基礎I, II[経営学部](通年) 担当
    - 摂南大学 微積分 II[理工学部](前期開講) 担当
  - 2014:
    - 京都大学 情報基礎[理学部](後期開講) 担当(分担)
    - 摂南大学 数学基礎I, II[経営学部](通年) 担当
    - 摂南大学 微積分 II[理工学部](前期開講) 担当
  - 2013:
    - 京都大学 情報基礎[理学部](後期開講) 担当(分担)
    - 摂南大学 数学基礎I, II[経営学部](通年) 担当
    - 摂南大学 微積分 II[理工学部](前期開講) 担当
  - 2012:
    - 京都大学 情報基礎[理学部](後期開講) 担当(分担)
    - 摂南大学 数学基礎I, II[経営学部](通年) 担当
  - 2011:
    - 京都大学 情報基礎[理学部](後期開講) 担当
* その他
** 雑誌記事
   - _佐々木洋平_, 2013:
     Ruby in Debian (2),
     Software Design 2013年10月号「Debian Hot Topics」,
     技術評論社
   - _佐々木洋平_, 2013:
     Ruby in Debian (1),
     Software Design 2013年9月号「Debian Hot Topics」,
     技術評論社
   - _佐々木 洋平_, 2012:
     Offlineimap + Dovecot で快適メール環境,
     Ubuntu Weekly Recipe 第247回,
     [[http://gihyo.jp/admin/serial/01/ubuntu-recipe/0247]]
   - _佐々木 洋平_, 2012:
     Debian - Debian の魅力と特徴,
     Software Design 2012年2月号, 第2特集「あなたをもっと自由にする OS - Debian を使い倒せ!」
     技術評論社
