research/index.html
<div id="outline-container-org4dc4f09" class="outline-3">
<h3 id="org4dc4f09">国内</h3>
<div class="outline-text-3" id="text-org4dc4f09">
<ul class="org-ul">
<li>佐々木洋平, 竹広真一, 石渡正樹, 山田道夫 2016:
回転球殻内の非弾性熱対流の臨界モードに対する熱拡散係数の動径分布の影響,
2016年日本流体力学会年会</li>
<li>竹広真一, 佐々木洋平 2016:
回転球殻中の磁気対流により引き起こされる平均帯状流の外側安定成層への貫入.
2016 年日本流体力学会年会</li>
<li>竹広真一, 佐々木洋平, 2016:
回転球殻中の磁気対流により引き起こされる平均帯状流の外側安定成層への貫入.
日本地球惑星科学連合 2016 年大会, 2016 年 5 月 23 日,
幕張メッセ国際会議場 講演セッション (講演番号: MIS10-P05)</li>
<li>佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2016:
高速回転する薄い球殻内の熱対流により生成される表層縞状構造への力学的境界条件の影響.
日本地球惑星科学連合 2016 年大会</li>
<li>佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2016:
高速回転する薄い球殻内の熱対流により引き起こされる表層縞状構造の消滅,
2016 年日本天文学会春季大会, 2016 年 3 月 15日, 首都大学東京 (講演番号 Z322b)</li>
<li>佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2016:
高速回転する薄い球殻内の熱対流により生成される表層縞状構造への力学的境界条件の影響.
惑星大気研究会「水惑星」 2016 年 3 月 10 日, 神戸大学惑星科学研究センター</li>
<li>竹広真一, 佐々木洋平, 石岡圭一, 2016:
高速回転する薄い球殻内の熱対流により引き起こされる表層縞状構造への力学的境界条件の影響,
平成 27 年度地球シミュレータ利用報告会, 2016 年 3 月 11 日 (金), コクヨホール</li>
<li>佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2016:
高速回転する薄い球殻内の熱対流により生成される表層縞状構造への力学的境界条件の影響.
2016 年春季気象学会</li>
<li>佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2015:
高速回転する薄い球殻内の熱対流により引き起こされる表層縞状構造の消滅.
2015 年日本流体力学会年会, 東工大大岡山キャンパス</li>
<li>佐々木洋平, 竹広真一, 2015:
回転球殻ダイナモにより引き起こされる磁気流体擾乱の強い安定成層への貫入.
日本地球惑星科学連合 2015 年大会.</li>
<li>佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2015:
高速に回転する薄い球殻内の熱対流により引き起こされる表層縞状構造の消滅.
日本地球惑星科学連合 2015 年大会.</li>
<li>佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2015:
高速に回転する薄い球殻内の熱対流により引き起こされる表層縞状構造の消滅.
2015 年 日本気象学会春季大会</li>
<li>佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2014:
高速回転する薄い球殻中の対流により引き起こされる表層の帯状流,
日本気象学会 2014 年度秋季大会, 福岡国際会議場</li>
<li>佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2014:
高速回転する薄い球殻内の熱対流により引き起こされる表層の帯状流,
2014 年日本流体力学会年会, 2014 年 9 月 15 日, 東北大学川内北キャンパス</li>
<li>佐々木洋平, 竹広真一, 石岡圭一, 中島健介, 林祥介, 2014:
高速に回転する薄い球殻内の熱対流により引き起こされる表層の帯状流,
日本地球惑星科学連合 2014 年大会, 2014年5月1日(木), 講演番号 PCG38-01</li>
<li>竹広真一, 佐々木洋平, 林祥介, 山田道夫, 2013:
回転球殻内の熱対流による角運動量輸送と太陽差分回転について,
2013 年日本流体力学会年会 2013 年 9 月 13 日 東京農工大学</li>
<li>佐々木洋平, 竹広真一, 中島 健介, 林祥介, 2013:
回転球殻内の非弾性流体熱対流の線型安定性,
2013 年日本流体力学会年会 2013 年 9 月 13 日, 東京農工大学</li>
<li>佐々木 洋平, 竹広 真一, 中島 健介, 林 祥介, 2013:
恒星・ガス惑星・氷惑星内部を念頭においた非弾性球殻対流モデル,
日本地球惑星科学連合 2013 年大会 2013 年 5 月 20 日: 幕張メッセ国際会議場.</li>
<li>竹広真一, 佐々木洋平, 林祥介, 山田道夫 2013:
回転球殻内の熱対流によって引き起こされる差分回転と角運動量輸送.
2013 年日本天文学会春季大会, 2013 年 3 月 22 日, 埼玉大学.</li>
<li>佐々木洋平, 竹広真一, 2013:
ガス惑星を念頭に置いた回転球殻対流,
系外惑星大気ワークショップ 2013 年 3 月 4 - 5 日, 東京大学</li>
<li>Shin-ichi Takehiro, Yoshiyuki O. Takahashi, Ko-ichiro Sugiyama, Masatsugu Odaka, Masaki Ishiwatari, Youhei Sasaki, Seiya Nishizawa, Keiichi Ishioka, Kensuke Nakajima, Yoshi-Yuki Hayashi, 2013:
Construction of Hierarchical Models for Fluid Dynamics in Earth and Planetary Sciences : DCMODEL project,
惑星大気小研究会, 2013 年 2 月 5 日, 惑星科学研究センター</li>
<li><span class="underline">佐々木洋平</span>, 竹広真一, 中島健介, 林祥介, 2012:
薄い回転球殻対流により引き起こされる表層の帯状流,
日本惑星科学会 2012年度秋季講演会,
2012年 10 月 25 日, 神戸大学統合研究拠点</li>
<li><span class="underline">佐々木 洋平</span>, 竹広 真一, 西澤 誠也, 林 祥介, 2012:
階層的地球流体スペクトルモデル集 SPMODEL を用いた 惑星磁場ダイナモ計算
第132回 SGEPSS総会および講演会,
2012 年 10 月 23 日 (火), 札幌コンベンションセンター</li>
<li><span class="underline">佐々木 洋平</span>, 竹広 真一, 中島 健介, 林 祥介, 2012:
薄い回転球殻対流により引き起こされる表層の帯状流,
日本気象学会 2012 年度秋季大会,
2012 年 10 月 3 日, 北海道大学学術交流会館(講演番号 C168)</li>
<li>竹広 真一, <span class="underline">佐々木 洋平</span>, 中島 健介, 林 祥介, 2012 :
熱フラックス固定条件下での高速回転する円筒内の熱対流の線形安定性に対するエクマン摩擦の影響,
日本流体力学会年会2012, 2012 年 9 月 17 日, 高知大学朝倉キャンパス</li>
<li><span class="underline">佐々木 洋平</span>, 竹広 真一, 中島 健介, 林 祥介, 2012 :
薄い回転球殻対流により引き起こされる表層の帯状流,
日本流体力学会年会2012, 2012 年 9 月 16 日, 高知大学朝倉キャンパス</li>
<li><span class="underline">佐々木 洋平</span>, 竹広 真一, 中島 健介, 林 祥介, 2012:
恒星・ガス惑星の深部大気対流モデルの構築,
日本地球惑星科学連合 2012 年大会, 講演番号JP-PS21</li>
<li><span class="underline">佐々木 洋平</span>, 竹広 真一, 西澤 誠也, 中島 健介, 林 祥介, 2012:
回転球殻ダイナモに対する緯度方向不均一な内側浮力フラックス境界条件の影響.
日本地球惑星科学連合 2012 年大会., 講演番号JS-EM21</li>
<li>高橋 芳幸, 杉山 耕一朗, 小高 正嗣, 石渡 正樹, <span class="underline">佐々木 洋平</span>, 西澤誠也, 中島 健介 竹広 真一, 林 祥介, 2011:
共通のプログラムスタイルを持つ大気大循環モデルと雲解像モデルの開発,
日本惑星科学会 2011 年秋季講演会, 2011 年 11 月 25 日, 相模女子大学翠葉会館 (講演番号 S32-06).</li>
<li>高橋 芳幸, 杉山耕一朗, 小高 正嗣, 石渡 正樹, <span class="underline">佐々木 洋平</span>, 西澤 誠也, 中島 健介, 竹広 真一, 林 祥介, 2011:
惑星大気計算のための大循環モデルならびに雲解像モデルの構築,
日本気象学会 2011 年度秋季大会, 2011 年 11 月 16 日, 名古屋大学東山キャンパス (講演番号 D111).</li>
<li>竹広 真一, <span class="underline">佐々木 洋平</span>, 西澤 誠也, 中島 健介, 林 祥介, 2011 :
回転球殻ダイナモに対する緯度方向不均一な内側浮力フラックス境界条件の影響,
日本流体力学会年会 2011, 2011 年 9 月 7 日, 首都大学東京南大沢キャンパス.</li>
<li><span class="underline">佐々木 洋平</span>, 竹広 真一, 倉本 圭, 林 祥介, 2011:
回転球殻MHDダイナモの初期磁場依存性,
日本地球惑星科学連合 2011 年大会, 2011 年 5 月 26 日, 幕張メッセ国際会議場 (講演番号 S-EM36).</li>
<li><span class="underline">佐々木 洋平</span>, 竹広 真一, 2011:
熱フラックス固定境界条件下での回転球殻熱対流の線形安定性解析,
日本地球惑星科学連合 2011 年大会, 2011 年 5 月 22 日, 幕張メッセ国際会議場 (講演番号 MIS021-P02)</li>
<li><span class="underline">佐々木 洋平</span>, 竹広 真一, 林 祥介, 2010:
回転球殻 MHDダイナモにおける上部力学的境界条件の影響,
国立天文台 CfCAユーザーズミーティング, 2010 年 1 月 12 ～ 13 日, 国立天文台三鷹キャンパス.</li>
<li><span class="underline">佐々木 洋平</span>, 竹広 真一, 林 祥介, 2008:
回転球殻 MHD ダイナモにおける力学的境界条件の影響
国立天文台 CfCA ユーザーズミーティング, 2008 年 12 月 17日, 国立天文台三鷹キャンパス.</li>
<li><span class="underline">佐々木 洋平</span>, 竹広 真一, 林 祥介, 倉本 圭, 2008:
下端に粘着条件・上端に応力無し条件を課した回転球殻 MHD ダイナモ計算,
日本地球惑星科学連合 2008 年大会, 2008 年 5 月 28 日, 幕張メッセ国際会議場, 講演番号: E111-011</li>
<li><span class="underline">佐々木 洋平</span>, 小高 正嗣, 林 祥介, 竹広 真一, 2004:
ダイナモベンチマーク・ケース1 における磁場生成維持機構の解析,
地球惑星科学関連学会 2004年合同大会, 2004 年 5 月 12 日, 幕張メッセ国際会議場, 講演番号: E012-004</li>
<li><span class="underline">佐々木 洋平</span>, 竹広真一, 林祥介, 2002:
回転球殻 MHD ダイナモの数値モデルの構築,
理論天文学懇談会, 2002 年 12 月 24日(火) - 26 日(木), 国立天文台三鷹キャンパス</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org72a03f3" class="outline-2">
<h2 id="org72a03f3">教育</h2>
<div class="outline-text-2" id="text-org72a03f3">
<ul class="org-ul">
<li>2015:
<ul class="org-ul">
<li>京都大学 情報基礎[理学部](後期開講) 担当(分担)</li>
<li>摂南大学 数学基礎I, II[経営学部](通年) 担当</li>
<li>摂南大学 微積分 II[理工学部](前期開講) 担当</li>
</ul></li>
<li>2014:
<ul class="org-ul">
<li>京都大学 情報基礎[理学部](後期開講) 担当(分担)</li>
<li>摂南大学 数学基礎I, II[経営学部](通年) 担当</li>
<li>摂南大学 微積分 II[理工学部](前期開講) 担当</li>
</ul></li>
<li>2013:
<ul class="org-ul">
<li>京都大学 情報基礎[理学部](後期開講) 担当(分担)</li>
<li>摂南大学 数学基礎I, II[経営学部](通年) 担当</li>
<li>摂南大学 微積分 II[理工学部](前期開講) 担当</li>
</ul></li>
<li>2012:
<ul class="org-ul">
<li>京都大学 情報基礎[理学部](後期開講) 担当(分担)</li>
<li>摂南大学 数学基礎I, II[経営学部](通年) 担当</li>
</ul></li>
<li>2011:
<ul class="org-ul">
<li>京都大学 情報基礎[理学部](後期開講) 担当</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7466cb0" class="outline-2">
<h2 id="org7466cb0">その他</h2>
<div class="outline-text-2" id="text-org7466cb0">
</div><div id="outline-container-orge47d56d" class="outline-3">
<h3 id="orge47d56d">雑誌記事</h3>
<div class="outline-text-3" id="text-orge47d56d">
<ul class="org-ul">
<li><span class="underline">佐々木洋平</span>, 2013:
Ruby in Debian (2),
Software Design 2013年10月号「Debian Hot Topics」,
技術評論社</li>
<li><span class="underline">佐々木洋平</span>, 2013:
Ruby in Debian (1),
Software Design 2013年9月号「Debian Hot Topics」,
技術評論社</li>
<li><span class="underline">佐々木 洋平</span>, 2012:
Offlineimap + Dovecot で快適メール環境,
Ubuntu Weekly Recipe 第247回,
<a href="http://gihyo.jp/admin/serial/01/ubuntu-recipe/0247">http://gihyo.jp/admin/serial/01/ubuntu-recipe/0247</a></li>
<li><span class="underline">佐々木 洋平</span>, 2012:
Debian - Debian の魅力と特徴,
Software Design 2012年2月号, 第2特集「あなたをもっと自由にする OS - Debian を使い倒せ!」
技術評論社</li>
</ul>
</div>
</div>
</div>
